# labyrinth_game/constants.py
ROOMS = {
    'entrance': {
        'description': 'Вы в темном входе лабиринта. Стены покрыты мхом. На полу лежит старый факел.',
        'exits': {'north': 'hall', 'east': 'trap_room', 'west': 'hiden_treasure_room'},
        'items': ['torch'],
        'puzzle': None
    },
    'hall': {
        'description': 'Большой зал с эхом. По центру стоит пьедестал с запечатанным сундуком.',
        'exits': {'south': 'entrance', 'west': 'library', 'north': 'treasure_room'},
        'items': [],
        'puzzle': ('На пьедестале надпись: "Назовите число, которое идет после девяти". Введите ответ цифрой или словом.', ('10', 'десять'))
    },
    'trap_room': {
          'description': 'Комната с хитрой плиточной поломкой. На стене видна надпись: "Осторожно — ловушка".',
          'exits': {'west': 'entrance'},
          'items': ['rusty_key'],
          'puzzle': ('Система плит активна. Чтобы пройти, назовите слово "шаг" три раза подряд (введите "шаг шаг шаг")', ('шаг шаг шаг', 'шагшагшаг'))
    },
    'library': {
          'description': 'Пыльная библиотека. На полках старые свитки. Где-то здесь может быть ключ от сокровищницы.',
          'exits': {'east': 'hall', 'north': 'armory', 'west': 'hiden_vault'},
          'items': ['ancient_book'],
          'puzzle': ('В одном свитке загадка: "Что растет, когда его съедают?" (ответ одно слово)', 'резонанс')
    },
        'armory': {
          'description': 'Старая оружейная комната. На стене висит меч, рядом — небольшая бронзовая шкатулка.',
          'exits': {'south': 'library'},
          'items': ['sword', 'bronze_box'],
          'puzzle': None
    },
    'treasure_room': {
          'description': 'Комната, на столе большой сундук. Дверь заперта — нужен особый ключ.',
          'exits': {'south': 'hall','east': 'hiden_vault'},
          'items': ['treasure_chest'],
          'puzzle': ('Дверь защищена кодом. Введите код (подсказка: это число пятикратного шага, 2*5= ? )', ('10', 'десять'))
    },
    'hiden_vault': {
          'description': 'Неприметный подвал в углу в библиотеки. Для поднятия крышки требуется энергия звезд.',
          'exits': {'east': 'library'},
          'items': [],
          'puzzle': ('Дополните недостающий элемент в формуле энергии (подсказка: ?=m*c^2 )', 'e')
    },
    'hiden_treasure_room': {
        'description': 'Перед вами врата сотканные из теней, предмет за вратами даст невообразимое могущество',
        'exits': {'east': 'entrance'},
        'items': [],
        'puzzle': ('Назовите имя ключа (название предмета как в инвентаре)', ('ghost_key', 'ghost key'))
    }
}
